#+Title: Exercise 5.10
Design a new syntax for register-machine instructions and modify the simulator to use your new syntax. Can you implement your new syntax without changing any part of the simulator except the syntax procedures in this section?

Maybe adding a loop instruction will be interesting.
Let's say that we want to loop a set of instructions until a condition is satisfied, such as a while loop. We could have this syntax:

#+BEGIN_SRC scheme :eval no
  (define while-loop
    (make-machine
     '(a n)
     (list (list '< <)
           (list '+ +)
           (list '* *))

     '((while (op <) (reg n) (const 10))
       (assign n (op +) (reg n) (const 1))
       (assign a (op *) (reg n) (const 2))
       end-while)))
#+END_SRC

This input source should get transformed into

#+BEGIN_SRC scheme :eval no
  (define while-loop
    (make-machine
     '(a n)
     (list (list '< <)
           (list '+ +)
           (list '* *))

     '(while-gensym
       (unless (op <) (reg n) (const 10))
       (branch (label end-while-gensym))
       (assign n (op +) (reg n) (const 1))
       (assign a (op *) (reg n) (const 2))
       (goto (label while-gensym))
       end-while-gensym)))
#+END_SRC

There's an interesting point to note here. At the level of the programmer, the while syntax should work, no matter the number of while / end-while pairs, as well as nested while loops.

*** Single while
#+BEGIN_SRC scheme :session 5-10 :exports both
  (define while-loop
    (make-machine
     '(a n)
     (list (list '< <)
           (list '+ +)
           (list '* *))

     '((while (op <) (reg n) (const 10))
       (assign n (op +) (reg n) (const 1))
       (assign a (op *) (reg n) (const 2))
       end-while)))

  (set-register-contents! while-loop 'a 1)
  (set-register-contents! while-loop 'n 1)
  (start while-loop)
  (get-register-contents while-loop 'n)
#+END_SRC

#+RESULTS:
: 10

This is working as expected.

*** Nested while
#+BEGIN_SRC scheme :session 5-10 :exports both
  (define nested-while-loop
    (make-machine
     '(a n x)
     (list (list '< <)
           (list '+ +)
           (list '* *))

     '((while (op <) (reg n) (const 9))
      (assign n (op +) (reg n) (const 1))
      (assign x (const 0))
      (while (op <) (reg x) (const 7))
      (assign x (op +) (reg x) (const 1))
      (assign a (op +) (reg a) (const 1))
      end-while
      end-while)))

  (set-register-contents! nested-while-loop 'a 0)
  (set-register-contents! nested-while-loop 'n 0)
  (start nested-while-loop)
  (get-register-contents nested-while-loop 'a)
#+END_SRC

#+RESULTS:
: 63
